console.log(`joni Cemi jonii`.length);

let magma = `ავტორი: ჟუჟუ იოსელიანი

/ ლიზ  ბურბოს  მიხედვით /

ბავშვობის ხუთი ფსიქოლოგიური ტრავმა, რომლებიც განსაზღვრავს ჩვენი ხასიათის თავისებურებებს და თითოეულის შესაბამისი ხუთი  ნიღაბი, რომელიც ფარავს ჩვენს შინაგან ბუნებას,  ჩვენს ნამდვილ ,,მე’’-ს.

ფსიქოტრავმები და მისი შესაბამისი ნიღბები:

-  უარყოფის ტრავმა  -  გაქცეულის  ნიღაბი, პერსონაჟი -  გაქცეული

-  მიტოვების ტრავმა  -  დამოკიდებულის ნიღაბი, პერსონაჟი - დამოკიდებული

-  დამცირების ტრავმა   -  მაზოხისტის  ნიღაბი, პერსონაჟი - მაზოხისტი

-  ღალატის ტრავმა  -  მაკონტროლებლის  ნიღაბი, პერსონაჟი - მაკონტროლებელი

-  უსამართლობის ტრავმა - დამცველის/ხისტის ნიღაბი, პერსონაჟი - დამცველი/ხისტი

•           როგორია ტრავმისა და მისი ნიღბის  ძალაუფლება ჩვენს ქცევასა და ცხოვრებისეულ  სცენარებზე. 

•           როგორ ამოვიცნოთ ჩვენი ან სხვათა ბავშვობის ფსიქოტრავმები და ნიღბები, რომელია ჩვენი დომინანტი ტრავმა და მისი შესაბამისი ნიღაბი?

•           მოვლენათა ჩვენეულ ინტერპრეტირებას რამდენად განაპირობებს თითოეული ტრავმა და  ქცევის რა სტრატეგიებს განსაზღვრავს მისი შესაბამისი ნიღაბი, შინაგანი კონფლიქტები, კონფლიქტების გახსნა და ადაპტური ქცევის  სტრატეგიები.

•           როდის ვქმნით და ვირგებთ ნიღბებს, რომელიც თავდაცვაა ადრეულ ასაკში,  როგორ გავაცნობიეროთ, თავის დროზე საჭირო რწმენა-წარმოდგენები და კონცეპტები დღეს უსარგებლოა და  ვიპოვოთ ძალა მის მოსაცილებლად.

•           როგორ აღმოვაჩინოთ, გავიცნოთ და მივიღოთ ნიღბის ქვეშ დაფარული საკუთარი ინდივიდუალური უნიკალური ბუნება.

•           გონების რა ტიპის მახეებს გვთავაზობს საკუთარი ეგო და რატომ უყვარს ეგოს ,,სირაქლემას  პოზა?’’

•           რომელი ფსიქოლოგიური ტრავმა რომელ მშობელს უკავშირდება და როგორია გენეტიკური ტრავმის მექანიზმი, თაობიდა`;
console.log(magma.length);

let javalearn =
  "JavaScript arrays are resizable and can contain a mix of different data types. (When those characteristics are undesirable, use typed arrays instead.)";

console.log(javalearn.toLocaleUpperCase());
console.log(javalearn.toLocaleLowerCase());

console.log(magma.slice(5, 200));

let smallString = `broweulis oynnebi`;

console.log(smallString.replace(`n`, `g`));
console.log(smallString.replaceAll(`n`, `g`));

console.log(magma + javalearn);
